PKS1C/src/Catalogs/КлючевыеНосители/КлючевыеНосители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючевыеНосители</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоУстановки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PKS1C/src/InformationRegisters/ДатыКлючевыеНосители/ДатыКлючевыеНосители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыКлючевыеНосители</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/СменаДатКлючевыхНосителей/СменаДатКлючевыхНосителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаДатКлючевыхНосителей</name>
  <registerRecords>InformationRegister.ДатыКлючевыеНосители</registerRecords>
  <attributes>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </attributes>
  <attributes>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/Catalogs/КлючевыеНосители/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере(ТабДок, КлючевойНоситель)
	ТабДок.Очистить();
	
	Истекающие = 0;
	Неистекающие = 0;
	
	Макет = Справочники.КлючевыеНосители.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросДат = Новый Запрос;
	ЗапросДат.Текст = 
		"ВЫБРАТЬ
		|	ДатыКлючевыеНосителиСрезПоследних.RSAС КАК RSAС,
		|	ДатыКлючевыеНосителиСрезПоследних.RSAДо КАК RSAДо,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТС КАК ГОСТС,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТДо КАК ГОСТДо,
		|	ДатыКлючевыеНосителиСрезПоследних.Регистратор.Дата КАК Дата,
		|	ДатыКлючевыеНосителиСрезПоследних.КлючевойНоситель КАК КлючевойНоситель
		|ИЗ
		|	РегистрСведений.ДатыКлючевыеНосители.СрезПоследних(, ) КАК ДатыКлючевыеНосителиСрезПоследних
		|ГДЕ
		|	ДатыКлючевыеНосителиСрезПоследних.КлючевойНоситель = &КлючевойНоситель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";	
	
	ЗапросДат.УстановитьПараметр("КлючевойНоситель", КлючевойНоситель);
	РезультатЗапросаДат = ЗапросДат.Выполнить();	
	ВыборкаДат = РезультатЗапросаДат.Выбрать();
	
	Пока ВыборкаДат.Следующий() Цикл
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаДат.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.ГОСТС = Формат(ВыборкаДат.ГОСТС, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.ГОСТДо = Формат(ВыборкаДат.ГОСТДо, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.RSAС = Формат(ВыборкаДат.RSAС, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.RSAДо = Формат(ВыборкаДат.RSAДо, "ДФ=дд.ММ.гггг");
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(ТабДок, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	ФормаДокумента = ПолучитьФорму("Документ.СменаДатКлючевыхНосителей.Форма.ФормаДокумента");
	ФормаДокумента.Объект.КлючевойНоситель = Объект.Ссылка;
	ФормаДокумента.НаОсновании = Истина;
	ФормаДокумента.Открыть();
КонецПроцедуры
